{
    "title": "India's RRR wins Historic Golden Globe",
    "catogary": "Movie",
    "id": 3,
    "caption": "Image",
    "icon": "/RRR.png",
    "content": "<p><h4>India's RRR Wins Historic Golden Globe. RRR flim's catchy musical number, Naatu Naatu was awarded best original song, by beating the heavyweights like Taylor Swift and Rihanna.</h4></p> <p>SS Rajamouli's blockbuster was nominated in two categories <ul><li>Best original Song</li> <li>Best Non-English Language Flim</li></ul> But missed out in Best Non-English Language Flim and this <b>Golden Globe categorie was won by Argentina, 1985</b>.</p> <h3>The main competitor for Naatu Naatu were:</h3> <ul><li><b>'Carolina'</b> by Taylor Swift</li> <li><b>'Hold My Hand'</b> by Lady Gaga</li> <li><b>'Lift Me Up'</b> by Tems, Rihanna</li></ul> <span><img src='/modi.jpg' />This was the First time for Indian flim to win award at Golden Globe, and was Congratulated by many Stars..</span> <h3>What is Golden Globe award Who decides the winner and what catogary this award are given for.</h3> <p>The Golden Globe are awarded by the <b>Hollywood Foreign Press Association (HEPA)</b> which is an outside group of flim critics and thus the awards are given to <b>Flims and Television shows</b> that are generally critically acclaimed.</p> <p>The HEPA is an organisation made up of around 90 members (both American and Foreign) that cover the Flim & Television industry</p> <h3>Let's talk about RRR</h3> <p>The title RRR is an acronym for <b>'Roudram Ranam Rudhiram'</b> in telgu and translate for this in english is <b>'Rise Roar Revolt'</b> The movie RRR is an epic historical friction action movie from India set during British colonization in the 1920's that also features a number of incredible music and dance sequences. The movie comes from diretor <b>SS. Rajamouli</b> and stars <b>N.T. Rama Rao Jr</b> and <b>Ram Charan</b> as reel-life revolutionaries where <b>Komaram Bheem was played by NTR</b> and <b>Sitarama Raju was played by Ram Charan.</b> It was a fictional Story was created by <b>SS. Rajamouli</b>, Tho Historical Stories says that they never met.</p> <p>The Star Cast of this flim are <b>Ajay Devgan, Alia Bhatt, Olivia Morris, Shriya Saran, Alison Doody and Ray Stevenson</b>. RRR was released in multi Language including US on <b>March 25.</b></br> Since then it has become <b>India's forth highest-growsing movie of all time.</b> This movie had made a collection over <b>Rs. 1,200 crore globally</b> and has won a slew of International honours including <b>Best Director at the New York Flim Critics Circle award</b>.</p> <h3>The Naatu Naatu song</h3> <p>This song starts with a music, ranging from romantic ballads to gleeful dance numbers and <b>patriotic anthems</b>, has also won heart of many fans. The song Naatu Naatu, a <b>four-and-a-half-minute</b> stomper of a song, features <b>Ram Charan</b> and <b>Jr. NTR</b>, This songs energtic moves and bass had inspired many fans to go crazy on social.</br> This song Choreographer <b>Prem Rakshit</b> said that he composed nearly <b>95 dance steps for this song with 30 different version of signature step</b> in the chorus alone.</br> It took almost <b>19 months from first discussion until the final render</b>.</p> <h3>Interesting Fact about Naatu Naatu.</h3> <p><img src='/palace.jpg'/>The song was filmed in front of <b>Ukraine president Volodymyr Zelensky's offical residence in 2021</b>.</br> It was shot in front of <b>Mariinskyi Palace in Ukraine- a gorgeous sea blue structure of baroque architecture</b> months before the war began.</br> SS. Rajamouli in a interview said <b>'luckily, they gave us permission to shoot because the Ukrainian president [Mr Zelensky] was a television actor.<b></p>'<p> <h5>Thanks for your time see you in next post</h5></p>",
    "author": "Satyam kumar",
    "metadesc": "India's RRR Wins Historic Golden Globe. RRR flim's catchy musical number, Naatu Naatu was awarded best original song, by beating the.......",
    "slug": "India's RRR wins Historic Golden Globe",
     "date": "11-01-2023"
}